Repository: soapyigu/wifi-lens
Catalog: WifiLens/Localizable.xcstrings
Source language: en
Languages: es, fr, ja, zh_hans

source: Approve the prompt on your device, then we'll verify the connection.
es: Aprueba la solicitud en tu dispositivo, luego verificaremos la conexión.
fr: Approuvez l'invite sur votre appareil, puis nous vérifierons la connexion.
ja: デバイスの確認ダイアログを承認すると、 接続を検証します。
zh_hans: 在您的设备上批准提示， 然后我们会验证连接。

source: Back to Scan
es: Volver al escaneo
fr: Retour au scan
ja: スキャンに戻る
zh_hans: 返回扫描

source: Both fields detected — hold steady to confirm...
es: Ambos campos detectados — mantén estable para confirmar…
fr: Les deux champs détectés — maintenez pour confirmer…
ja: 両方の項目を検出— 動かさず確認してください…
zh_hans: 两项均已识别—— 请保持稳定以确认…

source: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
zh_hans: 取消

source: Connect
es: Conectar
fr: Connecter
ja: 接続
zh_hans: 连接

source: Connected!
es: ¡Conectado!
fr: Connecté !
ja: 接続完了！
zh_hans: 已连接！

source: Connecting...
es: Conectando…
fr: Connexion en cours…
ja: 接続中…
zh_hans: 正在连接…

source: Connection Failed
es: Error de conexión
fr: Échec de la connexion
ja: 接続に失敗しました
zh_hans: 连接失败

source: Could not connect to **%@**
es: No se pudo conectar a **%@**
fr: Connexion impossible à **%@**
ja: **%@** に接続できませんでした
zh_hans: 无法连接到 **%@**

source: Detected Wi-Fi
es: Wi-Fi detectado
fr: Wi-Fi détecté
ja: 検出された Wi-Fi
zh_hans: 检测到的 Wi-Fi

source: Done
es: Listo
fr: Terminé
ja: 完了
zh_hans: 完成

source: Found Wi-Fi details
es: Datos de Wi-Fi detectados
fr: Détails Wi-Fi détectés
ja: Wi-Fi 情報を検出しました
zh_hans: 已找到 Wi-Fi 信息

source: Found Wi-Fi details!
es: ¡Datos de Wi-Fi detectados!
fr: Détails Wi-Fi détectés !
ja: Wi-Fi 情報を検出しました！
zh_hans: 已找到 Wi-Fi 信息！

source: Found network name — looking for password...
es: Nombre de red encontrado — buscando la contraseña…
fr: Nom du réseau trouvé — recherche du mot de passe…
ja: ネットワーク名を検出— パスワードを検索中…
zh_hans: 已找到网络名称—— 正在查找密码…

source: Found password — looking for network name...
es: Contraseña encontrada — buscando el nombre de la red…
fr: Mot de passe trouvé — recherche du nom du réseau…
ja: パスワードを検出— ネットワーク名を検索中…
zh_hans: 已找到密码—— 正在查找网络名称…

source: Looking for Wi-Fi name and password...
es: Buscando el nombre de Wi-Fi y la contraseña…
fr: Recherche du nom Wi-Fi et du mot de passe…
ja: Wi-Fi 名とパスワードを 検索しています…
zh_hans: 正在查找 Wi-Fi 名称 和密码…

source: Looks good
es: Todo correcto
fr: Tout est bon
ja: 問題ありません
zh_hans: 看起来没问题

source: Network Name
es: Nombre de la red
fr: Nom du réseau
ja: ネットワーク名
zh_hans: 网络名称

source: Password
es: Contraseña
fr: Mot de passe
ja: パスワード
zh_hans: 密码

source: Point your camera at a router label or Wi-Fi card. We'll detect the network and connect.
es: Apunta la cámara a la etiqueta del router o a una tarjeta Wi-Fi. Detectaremos la red y nos conectaremos.
fr: Pointez l'appareil photo vers l'étiquette du routeur ou une carte Wi-Fi. Nous détecterons le réseau et nous y connecterons.
ja: ルーターのラベルまたは Wi-Fi カードにカメラを向けてください。ネットワークを検出して接続します。
zh_hans: 将相机对准路由器标签或 Wi-Fi 卡片，我们会自动识别并连接网络。

source: Processing happens on-device
es: El procesamiento ocurre en el dispositivo
fr: Le traitement se fait sur l'appareil
ja: 処理はデバイス上で行われます
zh_hans: 全部处理均在设备本地完成

source: Rescan
es: Reescanear
fr: Relancer le scan
ja: 再スキャン
zh_hans: 重新扫描

source: Scan Another
es: Escanear otra
fr: Scanner une autre
ja: 別のネットワークをスキャン
zh_hans: 扫描其他

source: Start Scanning
es: Iniciar escaneo
fr: Démarrer le scan
ja: スキャンを開始
zh_hans: 开始扫描

source: Successfully connected to **%@**
es: Conexión correcta a **%@**
fr: Connexion réussie à **%@**
ja: **%@** に接続しました
zh_hans: 已成功连接到 **%@**

source: The password may be incorrect or the network is out of range.
es: La contraseña puede ser incorrecta o la red está fuera de alcance.
fr: Le mot de passe est peut-être incorrect ou le réseau est hors de portée.
ja: パスワードが正しくないか、ネットワークが圏外の可能性があります。
zh_hans: 密码可能不正确，或网络已超出范围。

source: Try Again
es: Intentar de nuevo
fr: Réessayer
ja: 再試行
zh_hans: 重试
